**How do I remove columns/rows from a pandas DataFrame**?

In [5]:
import pandas as pd

In [6]:
ufo = pd.read_csv("http://bit.ly//uforeports")
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
ufo.shape

(18241, 5)

In [8]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

**Method:**1

In [10]:
ufo.drop('Colors Reported', axis=1, inplace=True)
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [14]:
ufo.drop('Shape Reported',axis=1,inplace=True)
ufo.head()

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

**Method:**2

In [15]:
ufo = pd.read_csv("http://bit.ly//uforeports")
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [17]:
ufo.drop(['Colors Reported', 'Shape Reported', 'State'], inplace=True,axis=1)
ufo.head()

                   City             Time
0                Ithaca   6/1/1930 22:00
1           Willingboro  6/30/1930 20:00
2               Holyoke  2/15/1931 14:00
3               Abilene   6/1/1931 13:00
4  New York Worlds Fair  4/18/1933 19:00

**Rows**
* Axis = 1 for columns
* Axis = 0 for rows

In [18]:
ufo.shape

(18241, 2)

In [19]:
ufo.drop([0,1],axis=0,inplace=True) # will remove two rows
ufo.head()

                   City             Time
2               Holyoke  2/15/1931 14:00
3               Abilene   6/1/1931 13:00
4  New York Worlds Fair  4/18/1933 19:00
5           Valley City  9/15/1934 15:30
6           Crater Lake   6/15/1935 0:00

In [20]:
ufo.shape

(18239, 2)

Here, no of rows decreses